---
kind: enumMember
id: F:Autodesk.Revit.UI.Selection.PickBoxStyle.Crossing
enum: Autodesk.Revit.UI.Selection.PickBoxStyle
source: html/b66a5404-4dba-abc0-f16d-0477e5c8a974.htm
---
# Autodesk.Revit.UI.Selection.PickBoxStyle.Crossing

Draws the box with the style that is used when selecting objects completely or partially inside the box.